In [1]:
import pandas as pd

In [5]:
data = [["Max", 24, "Teacher"], ["James", 29, "GP"], ["Britney", 27, "Taxi Driver"], ["Ethan", 31, "Aerospace Engineer"]]

In [7]:
dataframe = pd.DataFrame(data, columns=["Name", "Age", "Qualification"], index=["a","b", "c", "d"])

print(dataframe)

      Name  Age       Qualification
a      Max   24             Teacher
b    James   29                  GP
c  Britney   27         Taxi Driver
d    Ethan   31  Aerospace Engineer

In [12]:
datadict = {"Name": ["Max", "James", "Britney", "Ethan"], "Age": [24, 29, 27, 31], "Qualification": ["Teacher", "GP", "Britney", "Ethan"]}

In [15]:
dataframedict = pd.DataFrame(datadict, index=["a", "b", "c", "d"])

In [16]:
print(dataframedict)

      Name  Age Qualification
a      Max   24       Teacher
b    James   29            GP
c  Britney   27       Britney
d    Ethan   31         Ethan

In [17]:
textdata = pd.read_csv("books.csv")

In [18]:
textdata.shape

(550, 7)

In [19]:
textdata.dtypes

Name           object
Author         object
UserRating    float64
Reviews         int64
Price           int64
Year            int64
Genre          object
dtype: object

In [20]:
textdata.describe()

       UserRating       Reviews       Price         Year
count  550.000000    550.000000  550.000000   550.000000
mean     4.618364  11953.281818   13.100000  2014.000000
std      0.226980  11731.132017   10.842262     3.165156
min      3.300000     37.000000    0.000000  2009.000000
25%      4.500000   4058.000000    7.000000  2011.000000
50%      4.700000   8580.000000   11.000000  2014.000000
75%      4.800000  17253.250000   16.000000  2017.000000
max      4.900000  87841.000000  105.000000  2019.000000

In [22]:
textdata.head(7)

,Name,Author,UserRating,Reviews,Price,Year,Genre
0,10-Day Green Smoothie Cleanse,JJ Smith,4.7,17350,8,2016,Non Fiction
1,11/22/63: A Novel,Stephen King,4.6,2052,22,2011,Fiction
2,12 Rules for Life: An Antidote to Chaos,Jordan B. Peterson,4.7,18979,15,2018,Non Fiction
3,1984 (Signet Classics),George Orwell,4.7,21424,6,2017,Fiction
4,"5,000 Awesome Facts (About Everything!) (Natio...",National Geographic Kids,4.8,7665,12,2019,Non Fiction
5,A Dance with Dragons (A Song of Ice and Fire),George R. R. Martin,4.4,12643,11,2011,Fiction
6,A Game of Thrones / A Clash of Kings / A Storm...,George R. R. Martin,4.7,19735,30,2014,Fiction

In [23]:
textdata.iloc[6, 5]

2014

In [24]:
textdata.loc[6, "Name"]

'A Game of Thrones / A Clash of Kings / A Storm of Swords / A Feast of Crows / A Dance with Dragons'

In [25]:
textdata.iloc[4, 1]

'National Geographic Kids'

In [26]:
textdata.loc[4, "Author"]

'National Geographic Kids'

In [27]:
collegedata = {"Roll no": [25, 43, 34, 21, 12], "Name": ["Sakshi Williams", "Rony Rathi", "Andy Mishra", "Jony Devillians", "Jack Mayyer"], "Class": [2, 3, 4, 5, 6], "Rank": [1, 2, 1, 1, 3]}

collegedataframe = pd.DataFrame(collegedata)

In [28]:
collegedataframe.size

20

In [29]:
collegedataframe.shape

(5, 4)

In [30]:
collegedataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Roll no  5 non-null      int64
 1   Name     5 non-null      object
 2   Class    5 non-null      int64
 3   Rank     5 non-null      int64
dtypes: int64(3), object(1)
memory usage: 288.0+ bytes

In [31]:
print(collegedataframe)

   Roll no             Name  Class  Rank
0       25  Sakshi Williams      2     1
1       43       Rony Rathi      3     2
2       34      Andy Mishra      4     1
3       21  Jony Devillians      5     1
4       12      Jack Mayyer      6     3

In [34]:
collegedataframe.iloc[1:3, 0:4]

   Roll no         Name  Class  Rank
1       43   Rony Rathi      3     2
2       34  Andy Mishra      4     1

In [37]:
statesdata = pd.read_csv("states_all.csv")

statesdataframe = pd.DataFrame(statesdata)

In [38]:
statesdataframe.head

<bound method NDFrame.head of              PRIMARY_KEY          STATE  YEAR  ENROLL  TOTAL_REVENUE
0           1992_ALABAMA        ALABAMA  1992     NaN      2678885.0  \
1            1992_ALASKA         ALASKA  1992     NaN      1049591.0
2           1992_ARIZONA        ARIZONA  1992     NaN      3258079.0
3          1992_ARKANSAS       ARKANSAS  1992     NaN      1711959.0
4        1992_CALIFORNIA     CALIFORNIA  1992     NaN     26260025.0
...                  ...            ...   ...     ...            ...
1710       2019_VIRGINIA       VIRGINIA  2019     NaN            NaN
1711     2019_WASHINGTON     WASHINGTON  2019     NaN            NaN
1712  2019_WEST_VIRGINIA  WEST_VIRGINIA  2019     NaN            NaN
1713      2019_WISCONSIN      WISCONSIN  2019     NaN            NaN
1714        2019_WYOMING        WYOMING  2019     NaN            NaN

      FEDERAL_REVENUE  STATE_REVENUE  LOCAL_REVENUE  TOTAL_EXPENDITURE
0            304177.0      1659028.0       715680.0          2653798.0  \
1            106780.0       720711.0       222100.0           972488.0
2            297888.0      1369815.0      1590376.0          3401580.0
3            178571.0       958785.0       574603.0          1743022.0
4           2072470.0     16546514.0      7641041.0         27138832.0
...               ...            ...            ...                ...
1710              NaN            NaN            NaN                NaN
1711              NaN            NaN            NaN                NaN
1712              NaN            NaN            NaN                NaN
1713              NaN            NaN            NaN                NaN
1714              NaN            NaN            NaN                NaN

      INSTRUCTION_EXPENDITURE  ...  GRADES_4_G  GRADES_8_G  GRADES_12_G
0                   1481703.0  ...     57948.0     58025.0      41167.0  \
1                    498362.0  ...      9748.0      8789.0       6714.0
2                   1435908.0  ...     55433.0     49081.0      37410.0
3                    964323.0  ...     34632.0     36011.0      27651.0
4                  14358922.0  ...    418418.0    363296.0     270675.0
...                       ...  ...         ...         ...          ...
1710                      NaN  ...         NaN         NaN          NaN
1711                      NaN  ...         NaN         NaN          NaN
1712                      NaN  ...         NaN         NaN          NaN
1713                      NaN  ...         NaN         NaN          NaN
1714                      NaN  ...         NaN         NaN          NaN

      GRADES_1_8_G  GRADES_9_12_G  GRADES_ALL_G  AVG_MATH_4_SCORE
0              NaN            NaN      731634.0             208.0  \
1              NaN            NaN      122487.0               NaN
2              NaN            NaN      673477.0             215.0
3              NaN            NaN      441490.0             210.0
4              NaN            NaN     5254844.0             208.0
...            ...            ...           ...               ...
1710           NaN            NaN           NaN             247.0
1711           NaN            NaN           NaN             240.0
1712           NaN            NaN           NaN             231.0
1713           NaN            NaN           NaN             242.0
1714           NaN            NaN           NaN             246.0

      AVG_MATH_8_SCORE  AVG_READING_4_SCORE  AVG_READING_8_SCORE
0                252.0                207.0                  NaN
1                  NaN                  NaN                  NaN
2                265.0                209.0                  NaN
3                256.0                211.0                  NaN
4                261.0                202.0                  NaN
...                ...                  ...                  ...
1710             287.0                224.0                262.0
1711             286.0                220.0                266.0
1712             272.0                213.0                256.0
1713             289.0                220.0                267.0
1714             286.0                227.0                265.0

[1715 rows x 25 columns]>

In [39]:
statesdataframe.info

<bound method DataFrame.info of              PRIMARY_KEY          STATE  YEAR  ENROLL  TOTAL_REVENUE
0           1992_ALABAMA        ALABAMA  1992     NaN      2678885.0  \
1            1992_ALASKA         ALASKA  1992     NaN      1049591.0
2           1992_ARIZONA        ARIZONA  1992     NaN      3258079.0
3          1992_ARKANSAS       ARKANSAS  1992     NaN      1711959.0
4        1992_CALIFORNIA     CALIFORNIA  1992     NaN     26260025.0
...                  ...            ...   ...     ...            ...
1710       2019_VIRGINIA       VIRGINIA  2019     NaN            NaN
1711     2019_WASHINGTON     WASHINGTON  2019     NaN            NaN
1712  2019_WEST_VIRGINIA  WEST_VIRGINIA  2019     NaN            NaN
1713      2019_WISCONSIN      WISCONSIN  2019     NaN            NaN
1714        2019_WYOMING        WYOMING  2019     NaN            NaN

      FEDERAL_REVENUE  STATE_REVENUE  LOCAL_REVENUE  TOTAL_EXPENDITURE
0            304177.0      1659028.0       715680.0          2653798.0  \
1            106780.0       720711.0       222100.0           972488.0
2            297888.0      1369815.0      1590376.0          3401580.0
3            178571.0       958785.0       574603.0          1743022.0
4           2072470.0     16546514.0      7641041.0         27138832.0
...               ...            ...            ...                ...
1710              NaN            NaN            NaN                NaN
1711              NaN            NaN            NaN                NaN
1712              NaN            NaN            NaN                NaN
1713              NaN            NaN            NaN                NaN
1714              NaN            NaN            NaN                NaN

      INSTRUCTION_EXPENDITURE  ...  GRADES_4_G  GRADES_8_G  GRADES_12_G
0                   1481703.0  ...     57948.0     58025.0      41167.0  \
1                    498362.0  ...      9748.0      8789.0       6714.0
2                   1435908.0  ...     55433.0     49081.0      37410.0
3                    964323.0  ...     34632.0     36011.0      27651.0
4                  14358922.0  ...    418418.0    363296.0     270675.0
...                       ...  ...         ...         ...          ...
1710                      NaN  ...         NaN         NaN          NaN
1711                      NaN  ...         NaN         NaN          NaN
1712                      NaN  ...         NaN         NaN          NaN
1713                      NaN  ...         NaN         NaN          NaN
1714                      NaN  ...         NaN         NaN          NaN

      GRADES_1_8_G  GRADES_9_12_G  GRADES_ALL_G  AVG_MATH_4_SCORE
0              NaN            NaN      731634.0             208.0  \
1              NaN            NaN      122487.0               NaN
2              NaN            NaN      673477.0             215.0
3              NaN            NaN      441490.0             210.0
4              NaN            NaN     5254844.0             208.0
...            ...            ...           ...               ...
1710           NaN            NaN           NaN             247.0
1711           NaN            NaN           NaN             240.0
1712           NaN            NaN           NaN             231.0
1713           NaN            NaN           NaN             242.0
1714           NaN            NaN           NaN             246.0

      AVG_MATH_8_SCORE  AVG_READING_4_SCORE  AVG_READING_8_SCORE
0                252.0                207.0                  NaN
1                  NaN                  NaN                  NaN
2                265.0                209.0                  NaN
3                256.0                211.0                  NaN
4                261.0                202.0                  NaN
...                ...                  ...                  ...
1710             287.0                224.0                262.0
1711             286.0                220.0                266.0
1712             272.0                213.0                256.0
1713             289.0                220.0                267.0
1714             286.0                227.0                265.0

[1715 rows x 25 columns]>

In [ ]:
statesdataframe.